In [15]:
import pandas as pd
import numpy as np

In [2]:
train_df=pd.read_csv(r"C:\Users\chat2\Downloads\titanic\train.csv")
train_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [96]:
features=train_df.columns

In [238]:
test_df=pd.read_csv(r"C:\Users\chat2\Downloads\titanic\test.csv")
df=[train_df,test_df]
data_frame=pd.concat(df,sort='True')

In [117]:
dataframe_columns=train_df.columns
cat=[]
cat_df=pd.DataFrame()
cols = ['Feature', 'Datatype','Unique Count']
dat = pd.DataFrame(columns = cols)
for k in dataframe_columns:
    dat = dat.append({'Feature': str(k), 'Datatype': str(data_frame[k].dtype) ,'Unique Count':str(data_frame[k].nunique())},ignore_index=True)
dat

        Feature Datatype Unique Count
0   PassengerId    int64         1309
1      Survived  float64            2
2        Pclass    int64            3
3          Name   object         1307
4           Sex   object            2
5           Age  float64           98
6         SibSp    int64            7
7         Parch    int64            8
8        Ticket   object          929
9          Fare  float64          281
10        Cabin   object          186
11     Embarked   object            3

In [118]:

unique_counts = pd.DataFrame.from_records([(col, data_frame[col].nunique()) for col in data_frame.columns],
                          columns=['Column_Name', 'Num_Unique']).sort_values(by=['Num_Unique'])
unique_counts

    Column_Name  Num_Unique
8           Sex           2
10     Survived           2
2      Embarked           3
7        Pclass           3
9         SibSp           7
5         Parch           8
0           Age          98
1         Cabin         186
3          Fare         281
11       Ticket         929
4          Name        1307
6   PassengerId        1309

In [221]:
for k in dataframe_columns:
    if(data_frame[k].isnull().values.any()):
        print(k+"-"+"Yes has null values")
    else:
        print(k+"-"+"No null Values")

PassengerId-No null Values
Survived-Yes has null values
Pclass-No null Values
Name-No null Values
Sex-No null Values
Age-Yes has null values
SibSp-No null Values
Parch-No null Values
Ticket-No null Values
Fare-Yes has null values
Cabin-Yes has null values
Embarked-Yes has null values

In [124]:
#Code to detect numerical datatype. select_dtypes function helps
numerical_columns = data_frame.select_dtypes([np.number]).columns
numerical_columns

Index(['Age', 'Fare', 'Parch', 'PassengerId', 'Pclass', 'SibSp', 'Survived'], dtype='object')

In [101]:
from pandas.api.types import infer_dtype
a=["q",2]
infer_dtype(a,skipna='True')

'mixed-integer'

In [123]:
for col in features:
    print(infer_dtype(data_frame[col],skipna='True'))

integer
floating
integer
string
string
floating
integer
integer
string
floating
string
string

In [239]:
cat_col=['Survived','Pclass','Sex','SibSp','Parch','Embarked']
number=[]
unique_count=[]
top=[]
freq=[]
for col in cat_col:
    number.append(data_frame[col].count())
    unique_count.append(data_frame[col].nunique())
    top.append(data_frame[col].mode().values[0])
    freq.append(data_frame[col].value_counts().values[0])

In [245]:
cat_index=["Count of Categories","Unique Categories","Top Most Occuring Category Value","Frequency Most Occuring Category Value"]
freq_df=pd.DataFrame((np.array([number,unique_count,top,freq])),columns=cat_col,index=cat_index)
freq_df

,Survived,Pclass,Sex,SibSp,Parch,Embarked
Count of Categories,891,1309,1309,1309,1309,1307
Unique Categories,2,3,2,7,8,3
Top Most Occuring Category Value,0.0,3,male,0,0,S
Frequency Most Occuring Category Value,549,709,843,891,1002,914

In [246]:
data_frame['Embarked'].value_counts().values[0]

914

In [247]:
data_frame['Sex'].mode().values[0]

'male'

In [248]:

data_frame['Sex'].value_counts().argmax()

C:\Users\chat2\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
The current behaviour of 'Series.argmax' is deprecated, use 'idxmax'
instead.
The behavior of 'argmax' will be corrected to return the positional
maximum in the future. For now, use 'series.values.argmax' or
'np.argmax(np.array(values))' to get the position of the maximum
row.
  """Entry point for launching an IPython kernel.

'male'

[2, 3, 2, 7, 8, 3]